
	{
	"componentName": "IDM Engine",
	"componentDescription": "Novell Identity Manager (IDM) is a bi-directional data sharing and synchronization service. It acts as a data sharing “hub” for the enterprise, enabling data synchronization between disparate systems.IDM / DirXML Engine - This is the heart of Identity Manager. Its primary responsibility is the management of synchronization relationships between the engine's Identity Vault and the drivers associated with the connected systems.",	
	"why": "Within the typical enterprise there are many disparate systems, each containing duplicate identity data. Manual methods are typically used to add and remove this data from each system. If identity information changes then each of the systems must be updated. Since humans are prone to error, this manual approach leads to inaccuracies and security holes. As employees join and leave the company, it is not uncommon for the data stores of the various systems to contain incorrect or obsolete data. Identity data goes far beyond employee information. IDM manages identity for all types of objects (printers, groups, directories, etc.). IDM enables these types of changes to happen quickly and accurately, reducing cost and potential security risks. ",
	"architecture": "https://twiki.innerweb.novell.com/pub/IDApps/IdentityManagerDocumentsArchitecture/DirXMLOverview.png", 
	"videos": "",
	"reference": "Documents: <a href='https://twiki.innerweb.novell.com/bin/view/IDApps/IdentityManagerDocumentsArchitecture' target='_blank' >Click Here </a><br /><br />To view the training Video, download  the jar and start it using the command <i>java -jar downloaded recording jar </i>: <a href='http://164.99.162.55/IDM_DEV/elluminate-rec/IDM_ENGINE_KNOWLEDGE_TRANSFER_SESSION_3A.jar' target='_blank' >Click Here to download</a>",
	"tasks" : "After going through the document and video <br/>1. Install IDM <br/>2. Using Designer / iManager * create a driverset <br/>3. Add a Delimited text ( DL ) driver using designer / iManager * preconfig file<br/>4. Go through and understand each driver properties<br/>5. Enable the driver trace level to 5 and log it to a file: iManager -> Driver properties -> misc tab<br/>6. Add a csv file to the input folder and synchronize the user to IDM<br/>7. Open up the trace file go through each policy execution line by line<br/>8. Add an user in IDV through iManager and verify csv file is generated in the output folder<br/>9. Install remote loader in a windows or Linux machine.<br/>10. Using documentation configure delimited text driver in RL<br/>11. Update the driver configuration to talk to the DL driver hosted on remote loader<br/>12. Repeat steps 6 and 8 and verify<br/>13. From the driver overview page understand the position of each policy set.<br/>14. Open the driver filter and learn how to sync, ignore , notify on each channel. Go through the help page and understand the merge description<br/>   *Note: IManger be used if designer induction is not completed<br/>",
	"fileLocation" : "Download : <a href='http://164.99.162.210/induction/IDM_Core.pdf' target='_blank' > IDM Core pdf </a>",
	"component_creater" : "Ranjit"
}