
	{
	"componentName": "Role Based Provisioning Module (RBPM)",
	"componentDescription": "<p>The NetIQ Identity Manager Roles Based Provisioning Module is an add-on module to Identity Manager that provides a complete roles-based provisioning solution. At the heart of the Roles Based Provisioning Module is the User Application, which is the business user’s view into the information, resources, and capabilities of Identity Manager. </p><p>The User Application is a browser-based Web application that gives the user the ability to perform a variety of identity self-service and roles provisioning tasks. The User Application allows users to initiate provisioning and role assignment requests, and also manage the approval process for these requests.The Identity Manager User Application is secure, scalable, and easy to manage. Through streamlined user administration and processes, the User Application helps organizations reduce management costs, increase productivity and security, and comply with government regulations.</p> ",	
	"why": "The NetIQ Identity Manager Roles Based Provisioning Module is an add-on module to Identity Manager that provides a complete roles-based provisioning solution. At the heart of the Roles Based Provisioning Module is the User Application, which is the business user’s view into the information, resources, and capabilities of Identity Manager. The User Application is a browser-based Web application that gives the user the ability to perform a variety of identity self-service and roles provisioning tasks. The User Application allows users to initiate provisioning and role assignment requests, and also manage the approval process for these requests.The Identity Manager User Application is secure, scalable, and easy to manage. Through streamlined user administration and processes, the User Application helps organizations reduce management costs, increase productivity and security, and comply with government regulations.",
	"architecture": "https://www.netiq.com/documentation/idm45/ugpro/graphics/stoverview.png", 
	"videos": "https://www.youtube.com/embed/dLKX9bNQdn8",
	"reference": "Documents: <a href='https://www.netiq.com/documentation/idm45/ugpro/data/bookinfo.html' target='_blank' >Click Here </a>",
	"tasks" : "1. Create an user in RBPM </br>2. Create a group and add the users</br>3. Create a Resource</br>4. Create a resource with entitlement</br>5. Create a role</br>6. Add resource(s) to a role</br>7. Assign role to user/group/container  -  with and without approval</br>8. Assign resource to user   -  with and without approval</br>9. Revoke a role from user</br>10. Revoke a resource from user</br>11. Configure proxy for team members</br>12. Delegate a task to other users</br>13. Create SOD without approver from Userapp and RRA.</br>14. Create SODs with approver from Userapp and RRA.</br>15. Assign the conflicting role to user with above created SODs.</br>16. Assign a proxy for a user.</br>17. Login as proxy user and complete the  assigned task of user.</br>18. Assign a user as a delegate and try to complete the task as a delegated user.",
	"fileLocation" : "Download : <a href='http://164.99.162.210/induction/RBPM_Presentation.odp' target='_blank' >RBPM ppt </a>",
	"component_creater" : "Ranjit"
}